using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using WebStore.Infrastructure.Interfaces;
using WebStore.Models;

namespace WebStore.Infrastructure.Services
{
    public class InMemoryEmployeesData : IEmployeesData
    {
        private List<Employee> _Employees;

        public InMemoryEmployeesData()
        {
            Initialization();
        }

        private void Initialization()
        {
            _Employees = new();            
            string[] firstName =
                {
                    "Алан","Георгий","Константин","Роман",
                    "Александр","Герман","Лев","Ростислав",
                    "Алексей","Глеб","Леонид","Руслан",
                    "Альберт","Гордей","Макар","Рустам",
                    "Анатолий","Григорий","Максим","Савва",
                    "Андрей","Давид","Марат","Савелий",
                    "Антон","Дамир","Марк","Святослав",
                    "Арсен","Даниил","Марсель","Семен",
                    "Арсений","Демид","Матвей","Сергей",
                    "Артем","Демьян","Мирон","Станислав",
                    "Артемий","Денис","Мирослав","Степан",
                    "Артур","Дмитрий","Михаил","Тамерлан",
                    "Богдан","Евгений","Назар","Тимофей",
                    "Борис","Егор","Никита","Тимур",
                    "Вадим","Елисей","Николай","Тихон",
                    "Валентин","Захар","Олег","Федор",
                    "Валерий","Иван","Павел","Филипп",
                    "Василий","Игнат","Петр","Шамиль",
                    "Виктор","Игорь","Платон","Эдуард",
                    "Виталий","Илья","Прохор","Эльдар",
                    "Владимир","Ильяс","Рамиль","Эмиль",
                    "Владислав","Камиль","Ратмир","Эрик",
                    "Всеволод","Карим","Ринат","Юрий",
                    "Вячеслав","Кирилл","Роберт","Ян",
                    "Геннадий","Клим","Родион","Ярослав"
                };
            string[] lastName = {
                "Смирнов","Орехов","Денисов","Белоусов","Авдеев","Лазарев","Горшков","Кузьмин",
                "Иванов","Ефремов","Громов","Федотов","Зыков","Медведев","Чернов","Кудрявцев",
                "Кузнецов","Исаев","Фомин","Дорофеев","Бирюков","Ершов","Овчинников","Баранов",
                "Соколов","Евдокимов","Давыдов","Егоров","Шарапов","Никитин","Селезнёв","Куликов",
                "Попов","Калашников","Мельников","Матвеев","Никонов","Соболев","Панфилов","Алексеев",
                "Лебедев","Кабанов","Щербаков","Бобров","Щукин","Рябов","Копылов","Степанов",
                "Козлов","Носков","Блинов","Дмитриев","Дьячков","Поляков","Михеев","Яковлев",
                "Новиков","Юдин","Колесников","Калинин","Одинцов","Цветков","Галкин","Сорокин",
                "Морозов","Кулагин","Карпов","Анисимов","Сазонов","Данилов","Назаров","Сергеев",
                "Петров","Лапин","Афанасьев","Петухов","Якушев","Жуков","Лобанов","Романов",
                "Волков","Прохоров","Власов","Антонов","Красильников","Фролов","Лукин","Захаров",
                "Соловьёв","Нестеров","Маслов","Тимофеев","Гордеев","Журавлёв","Беляков","Борисов",
                "Васильев","Харитонов","Исаков","Никифоров","Самойлов","Николаев","Потапов","Королёв",
                "Зайцев","Агафонов","Тихонов","Веселов","Князев","Крылов","Некрасов","Герасимов",
                "Павлов","Муравьёв","Аксёнов","Филиппов","Беспалов","Максимов","Хохлов","Пономарёв",
                "Семёнов","Ларионов","Гаврилов","Марков","Уваров","Сидоров","Жданов","Григорьев",
                "Голубев","Федосеев","Родионов","Большаков","Шашков","Осипов","Ситников",
                "Виноградов","Зимин","Котов","Суханов","Наумов","Сысоев","Симонов",
                "Богданов","Пахомов","Горбунов","Миронов","Шилов","Фомичёв","Мишин",
                "Воробьёв","Шубин","Кудряшов","Ширяев","Воронцов","Русаков","Фадеев",
                "Фёдоров","Игнатов","Быков","Александров","Ермаков","Стрелков","Комиссаров",
                "Михайлов","Филатов","Зуев","Коновалов","Дроздов","Гущин","Мамонтов",
                "Беляев","Крюков","Третьяков","Шестаков","Игнатьев","Тетерин","Носов",
                "Тарасов","Рогов","Савельев","Казаков","Савин","Колобов","Гуляев",
                "Белов","Кулаков","Панов","Ефимов","Логинов","Субботин","Шаров",
                "Комаров","Терентьев","Рыбаков","Бобылёв","Сафонов","Фокин","Устинов",
                "Орлов","Молчанов","Суворов","Доронин","Капустин","Блохин","Вишняков",
                "Киселёв","Владимиров","Абрамов","Белозёров","Кириллов","Селиверстов","Евсеев",
                "Макаров","Артемьев","Воронов","Рожков","Моисеев","Пестов","Лаврентьев",
                "Андреев","Гурьев","Мухин","Самсонов","Елисеев","Кондратьев","Брагин",
                "Ковалёв","Зиновьев","Архипов","Мясников","Кошелев","Силин","Константинов",
                "Ильин","Гришин","Трофимов","Лихачёв","Костин","Меркушев","Корнилов",
                "Гусев","Кононов","Мартынов","Буров","Горбачёв","Лыткин",
                "Титов","Дементьев","Емельянов","Туров"
                };
            Random rand = new Random();
            int Count = rand.Next(30, 100);
            for (int i = 1; i < Count; i++)
            {
                _Employees.Add(
                    new Employee
                    {
                        Id = i,
                        FirstName = firstName[rand.Next(0, firstName.Length)],
                        LastName = lastName[rand.Next(0, lastName.Length)],
                        Age = rand.Next(0, 99)
                    }
                    );
            }
        }

        public int Add(Employee employee)
        {
            if (employee is null)
                throw new ArgumentNullException(nameof(employee));

            if (_Employees.Contains(employee))
                return employee.Id;
            employee.Id = _Employees
                .Select(item => item.Id)
                .DefaultIfEmpty()
                .Max() + 1;
            _Employees.Add(employee);

            return employee.Id;
        }

        public bool Delete(int id)
        {
            var item = Get(id);
            if (item is null) return false;
            return _Employees.Remove(item);
        }

        public IEnumerable<Employee> Get()
        {
            return _Employees;
        }

        public Employee Get(int id)
        {
            return _Employees.FirstOrDefault(item => item.Id == id);
        }

        public void Update(Employee employee)
        {
            if (employee is null)
                throw new ArgumentNullException(nameof(employee));
            if (_Employees.Contains(employee))
                return;
            var item = Get(employee.Id);
            if (item is null)
                return;
            item.LastName = employee.LastName;
            item.FirstName = employee.FirstName;
            item.Age = employee.Age;
        }
    }
}
